src/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрПлатежей</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Файлы/Ext/ManagerModule.bsl
//Код - код справочника
//Альтернатива - УИД 
Функция ПолучитьСтруктуруФайлаДляОтправки(Код) Экспорт   
	
	СтруктураФайла = Неопределено;
	
	Если ЗначениеЗаполнено(Код) Тогда 
		
		//Если будем юзать УИД
		//ИД = Новый УникальныйИдентификатор(УИД);
		//Файлик = Справочники.Файлы.ПолучитьСсылку(ИД);		
		
		Файлик = Справочники.Файлы.НайтиПоКоду(СокрЛП(Код));
						
		Если ЗначениеЗаполнено(Файлик) Тогда			
			
			СтруктураФайла = Новый Структура();
			СтруктураФайла.Вставить("Наименование", Файлик.Наименование);
			СтруктураФайла.Вставить("Расширение"  , Файлик.Расширение);
			СтруктураФайла.Вставить("Размер"      , Файлик.Размер);
			СтруктураФайла.Вставить("Автор"       , Строка(Файлик.Автор));
			СтруктураФайла.Вставить("КодВБазе"    , Код);
						
			ДДФайла       = Файлик.Данные.Получить();
			ДДФайлаBase64 = Base64Строка(ДДФайла);
			
			СтруктураФайла.Вставить("Данные"	  , ДДФайлаBase64);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураФайла;
	
КонецФункции

Функция СоздатьФайлИзСтруктуры(СтруктураФайла, Владелец) Экспорт
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайл.Наименование  = СтруктураФайла.Наименование;
	НовыйФайл.Расширение    = СтруктураФайла.Расширение;
	НовыйФайл.Автор         = СтруктураФайла.Автор;
	НовыйФайл.ВладелецФайла = Владелец;
	НовыйФайл.Размер        = СтруктураФайла.Размер;
	НовыйФайл.КодВБазе      = СтруктураФайла.КодВБазе;
	
	ДанныеФайла = Base64Значение(СтруктураФайла.Данные); 
	НовыйФайл.Данные = Новый ХранилищеЗначения(ДанныеФайла, Новый СжатиеДанных(9));	
	
	НовыйФайл.Записать();
	
	Возврат НовыйФайл.Ссылка;
	
КонецФункции
